// Лаба 1 N1.2 Б9 - точка принадлежит части плоскости

#include <iostream>
#include <cmath>

using namespace std;

int main() {

    double x = 0, y = 0, R = 0;

    cout << "R = ";
    cin >> R;
    do {
        if (R <= 0) {
            cout << "\"R\" должно быть больше 0 (R > 0)\n"
                 << "R = ";
            cin >> R;
        }
    } while (R <= 0);

    cout << "x = ";
    cin >> x;
    cout << "y = ";
    cin >> y;

    if (x >= 0 && y >= 0) {
        if (x <= 2 * R && y <= 2 * R && x * x + y * y >= R * R) {
            cout << "Точка (" << x << ";" << y << ") принадлежит плоскости\n";
        } else {
            cout << "Точка (" << x << ";" << y << ") не принадлежит плоскости\n";
        }
    }

    if (x <= 0 && y <= 0) {
        if (x + y >= -2 * R) {
            cout << "Точка (" << x << ";" << y << ") принадлежит плоскости\n";
        } else {
            cout << "Точка (" << x << ";" << y << ") не принадлежит плоскости\n";
        }
    }

    if ((x > 0 && y < 0) || (x < 0 && y > 0)) {
        cout << "Точка (" << x << ";" << y << ") не принадлежит плоскости\n";
    }

    return 0;
}
